[
  {
    "id": "login",
    "type": "video",
    "title": "How to Login to ShareMatch",
    "r2_file_name": "Streamline Login Process With Sharematch.mp4",
    "access_level": "public",
    "keywords": ["login", "sign in", "access account", "enter credentials", "authentication"],
    "content": "How to login to ShareMatch: Click the login option to begin accessing your ShareMatch account. Click here to open the login form where you can enter your credentials. Enter your email address to identify your ShareMatch account securely. Click the password field to input your secure password. Enter your password to authenticate your identity and gain access. Click the login button to submit your credentials and access your ShareMatch dashboard."
  },
  {
    "id": "signup",
    "type": "video",
    "title": "How to Sign Up for ShareMatch",
    "r2_file_name": "Streamline Signup Process With Sharematch Product Demo.mp4",
    "access_level": "public",
    "keywords": ["signup", "sign up", "register", "create account", "join", "registration"],
    "content": "How to sign up for ShareMatch: Click the Join Now button to begin the signup process on ShareMatch. Enter your full name. Enter your date of birth for age verification. Select your country of residence. Enter your email address. Enter your password. Enter your password again to confirm it matches. Enter your referral code if you have any to receive any applicable benefits. Click the continue button to proceed to the next sign up step. Enter your phone number. Enter your WhatsApp number. Click I agree to receive OTP via Email and WhatsApp to consent. Confirm your acceptance of terms of service and privacy policies. Click the create account button to finalize your registration. Enter OTP received via Email. Enter OTP received via WhatsApp. Account Created Successfully and Login to Continue."
  },
  {
    "id": "kyc",
    "type": "video",
    "title": "How to Complete KYC Verification on ShareMatch",
    "r2_file_name": "Streamline KYC Verification With Sharematch Demo.mp4",
    "access_level": "public",
    "keywords": ["kyc", "verification", "identity", "verify", "document", "id verification", "passport", "driving license"],
    "content": "How to complete KYC verification on ShareMatch: Click Start Verification to initiate the identity verification process within ShareMatch. Click continue in the SumSub interface to move forward with the verification steps. Click Start verification to launch the identity verification procedure in SumSub. Click agree and continue to accept the terms and proceed with the verification process. Select the identity document issuing country. Choose the type of identification document to be submitted for verification. Upload front side of the document. Upload backside of the document and click on continue. Your profile is verified successfully and you can start trading with ShareMatch."
  },
  {
    "id":"buyAssets",
    "type":"video",
    "title":"How to Buy Assets on ShareMatch",
    "r2_file_name":"How to buy.mp4",
    "access_level":"authenticated",
    "keywords":["buy","purchase","acquire","assets","invest"],
    "content":"How to buy assets on ShareMatch: Select an index to browse available assets. Choose the asset you want to purchase which will open the asset page. Click the Buy button on the asset page to initiate your purchase. Enter the number of units you want to buy. Agree to the Terms and Conditions and Risk Statement. Click Confirm Transaction to complete your purchase."
  },
  {
    "id":"sellAssets",
    "type":"video",
    "title":"How to Sell Assets on ShareMatch",
    "r2_file_name":"How to sell.mp4",
    "access_level":"authenticated",
    "keywords":["sell","trade","liquidate","assets","divest"],
    "content":"How to sell assets on ShareMatch: Select a position you want to sell from your portfolio. Choose which position you want to sell from your portfolio. Click Sell on the transaction slip to begin the selling process. Enter the number of units you want to sell. Agree to the Terms and Conditions and Risk Statement. Click Confirm Transaction to complete your sale."
  },
  {
    "id":"forgotPassword",
    "type":"video",
    "title":"How to Reset Your Password on ShareMatch",
    "r2_file_name":"forgot password.mp4",
    "access_level":"public",
    "keywords":["forgot password", "reset password", "password reset", "account recovery"],
    "content":"How to reset your password on ShareMatch: Click the Login button to access the login page. Click Forgot Password to start the password recovery process. Enter your email address associated with your ShareMatch account. Click Send Link to receive the password reset email. Open your email and click the Reset Password link. Enter your new password. Confirm your new password. Click Reset Password to save your new credentials. Enter your email address. Enter your new password and click Login to access your account with the changed password."
  },
  {
    "id":"updateUserDetails",
    "type":"video",
    "title":"How to Update User Details on ShareMatch",
    "r2_file_name":"How to update user details.mp4",
    "access_level":"authenticated",
    "keywords":["update details","edit profile","change information","user settings"],
    "content":"How to update user details on ShareMatch: Tap on the user profile icon to access your account. Click on Settings to view your account options. Click or tap the Edit button to modify your information. Enter your updated details in the respective fields. Click Save to confirm your changes. Enter your Email OTP if you changed your email address. Enter your WhatsApp OTP if you changed your WhatsApp number. Your details have been updated successfully."
  },
  {
    "id":"editMarketingPreferences",
    "type":"video",
    "title":"How to Edit Marketing Preferences on ShareMatch",
    "r2_file_name":"how to edit marketing preferences.mp4",
    "access_level":"authenticated",
    "keywords":["marketing preferences","edit marketing","change preferences","communication settings"],
    "content":"How to edit marketing preferences on ShareMatch: Tap on the user profile icon to access your account. Click on Settings to view your account options. Click or tap the Edit button to modify your preferences. Choose your marketing and communication preferences according to your needs. Click Save to update your marketing preferences."
  },
  {
    "id":"changePassword",
    "type":"video",
    "title":"How to Change Your Password on ShareMatch",
    "r2_file_name":"how to change password.mp4",
    "access_level":"authenticated",
    "keywords":["change password","update password","modify password","password settings"],
    "content":"How to change your password on ShareMatch: Tap on the user profile icon to access your account. Click on Settings to view your account options. Tap on Change Password to begin the password update process. Enter your current password for verification. Enter your new password. Confirm your new password to ensure it matches. Click or tap Update to save your new password."
  },
   {
    "id": "eplIndex",
    "type": "video",
    "title": "Understanding the English Premier League Index on ShareMatch",
    "r2_file_name": "English epl.mp4",
    "access_level": "authenticated",
    "keywords": ["epl", "premier league", "football index", "sports index", "index token"],
    "content": "Learn how the English Premier League Index works on ShareMatch. This video explains what the EPL index token represents, how index values are calculated, and how users can interact with the index on the platform."
  },
  {
    "id": "splIndex",
    "type": "video",
    "title": "Understanding the Saudi Pro League Index on ShareMatch",
    "r2_file_name": "English SPL.mp4",
    "access_level": "authenticated",
    "keywords": ["spl", "saudi pro league", "sports index", "football index", "index token"],
    "content": "Learn how the Saudi Pro League Index functions on ShareMatch. This video covers the concept of the SPL index token, its structure, and how users can view and trade the index within the platform."
  },
  {
    "id": "uefaIndex",
    "type": "video",
    "title": "Understanding the UEFA Champions League Index on ShareMatch",
    "r2_file_name": "English UEFA.mp4",
    "access_level": "authenticated",
    "keywords": ["uefa", "champions league", "sports index", "football index", "index token"],
    "content": "Learn how the UEFA Champions League Index operates on ShareMatch. This video explains the purpose of the index token, how index movements are reflected, and how users can engage with the index."
  },
  {
    "id": "nflIndex",
    "type": "video",
    "title": "Understanding the NFL Index on ShareMatch",
    "r2_file_name": "English NFL.mp4",
    "access_level": "authenticated",
    "keywords": ["nfl", "american football", "sports index", "index token"],
    "content": "Learn how the NFL Index works on ShareMatch. This video introduces the NFL index token, explains how index values change, and shows how users can interact with the index."
  },
  {
    "id": "nbaIndex",
    "type": "video",
    "title": "Understanding the NBA Index on ShareMatch",
    "r2_file_name": "English NBA Market.mp4",
    "access_level": "authenticated",
    "keywords": ["nba", "basketball", "sports index", "index token"],
    "content": "Learn how the NBA Index functions on ShareMatch. This video provides an overview of the index token, how it tracks overall market performance, and how users can trade the index."
  },
  {
    "id": "islIndex",
    "type": "video",
    "title": "Understanding the Indonesia Super League Index on ShareMatch",
    "r2_file_name": "English Indonesia Super League.mp4",
    "access_level": "authenticated",
    "keywords": ["isl", "indonesia super league", "sports index", "football index", "index token"],
    "content": "Learn how the Indonesia Super League Index operates on ShareMatch. This video explains the structure of the index token and how users can access and trade the index."
  },
  {
    "id": "t20Index",
    "type": "video",
    "title": "Understanding the T20 Cricket Index on ShareMatch",
    "r2_file_name": "English T20 World Cup.mp4",
    "access_level": "authenticated",
    "keywords": ["t20", "cricket", "sports index", "cricket index", "index token"],
    "content": "Learn how the T20 Cricket Index works on ShareMatch. This video explains the concept of the index token, how index performance is represented, and how users can interact with it."
  },
  {
    "id": "fifaIndex",
    "type": "video",
    "title": "Understanding the FIFA World Cup Index on ShareMatch",
    "r2_file_name": "English FIFA World Cup.mp4",
    "access_level": "authenticated",
    "keywords": ["fifa", "world cup", "sports index", "football index", "index token"],
    "content": "Learn how the FIFA World Cup Index functions on ShareMatch. This video covers what the index token represents and how users can view and trade the index on the platform."
  },
  {
    "id": "f1Index",
    "type": "video",
    "title": "Understanding the F1 Index on ShareMatch",
    "r2_file_name": "English Formula 1.mp4",
    "access_level": "authenticated",
    "keywords": ["f1", "formula 1", "motorsport", "sports index", "index token"],
    "content": "Learn how the F1 Index operates on ShareMatch. This video explains the index token model, how index values move, and how users can trade the index."
  }
]
